OpenEPaperLink/OpenEPaperLink/ARM_Tag_FW/cc2531_OEPL/contiki/sdcc/non-free/lib/src/pic16/libdev/pic18f4682.c
__at(0x0E22) __sfr B0SIDL;
__at(0x0E22) volatile __B0SIDLbits_t B0SIDLbits;

__at(0x0E23) __sfr B0EIDH;
__at(0x0E23) volatile __B0EIDHbits_t B0EIDHbits;

__at(0x0E24) __sfr B0EIDL;
__at(0x0E24) volatile __B0EIDLbits_t B0EIDLbits;

__at(0x0E25) __sfr B0DLC;
__at(0x0E25) volatile __B0DLCbits_t B0DLCbits;

__at(0x0E26) __sfr B0D0;
__at(0x0E26) volatile __B0D0bits_t B0D0bits;

__at(0x0E27) __sfr B0D1;
__at(0x0E27) volatile __B0D1bits_t B0D1bits;

__at(0x0E28) __sfr B0D2;
__at(0x0E28) volatile __B0D2bits_t B0D2bits;

__at(0x0E29) __sfr B0D3;
__at(0x0E29) volatile __B0D3bits_t B0D3bits;

__at(0x0E2A) __sfr B0D4;
__at(0x0E2A) volatile __B0D4bits_t B0D4bits;

__at(0x0E2B) __sfr B0D5;
__at(0x0E2B) volatile __B0D5bits_t B0D5bits;

__at(0x0E2C) __sfr B0D6;
__at(0x0E2C) volatile __B0D6bits_t B0D6bits;

__at(0x0E2D) __sfr B0D7;
__at(0x0E2D) volatile __B0D7bits_t B0D7bits;

__at(0x0E2E) __sfr CANSTAT_RO9;
__at(0x0E2E) volatile __CANSTAT_RO9bits_t CANSTAT_RO9bits;

__at(0x0E2F) __sfr CANCON_RO9;
__at(0x0E2F) volatile __CANCON_RO9bits_t CANCON_RO9bits;

__at(0x0E30) __sfr B1CON;
__at(0x0E30) volatile __B1CONbits_t B1CONbits;

__at(0x0E31) __sfr B1SIDH;
__at(0x0E31) volatile __B1SIDHbits_t B1SIDHbits;

__at(0x0E32) __sfr B1SIDL;
__at(0x0E32) volatile __B1SIDLbits_t B1SIDLbits;

__at(0x0E33) __sfr B1EIDH;
__at(0x0E33) volatile __B1EIDHbits_t B1EIDHbits;

__at(0x0E34) __sfr B1EIDL;
__at(0x0E34) volatile __B1EIDLbits_t B1EIDLbits;

__at(0x0E35) __sfr B1DLC;
__at(0x0E35) volatile __B1DLCbits_t B1DLCbits;

__at(0x0E36) __sfr B1D0;
__at(0x0E36) volatile __B1D0bits_t B1D0bits;

__at(0x0E37) __sfr B1D1;
__at(0x0E37) volatile __B1D1bits_t B1D1bits;

__at(0x0E38) __sfr B1D2;
__at(0x0E38) volatile __B1D2bits_t B1D2bits;

__at(0x0E39) __sfr B1D3;
__at(0x0E39) volatile __B1D3bits_t B1D3bits;

__at(0x0E3A) __sfr B1D4;
__at(0x0E3A) volatile __B1D4bits_t B1D4bits;

__at(0x0E3B) __sfr B1D5;
__at(0x0E3B) volatile __B1D5bits_t B1D5bits;

__at(0x0E3C) __sfr B1D6;
__at(0x0E3C) volatile __B1D6bits_t B1D6bits;

__at(0x0E3D) __sfr B1D7;
__at(0x0E3D) volatile __B1D7bits_t B1D7bits;

__at(0x0E3E) __sfr CANSTAT_RO8;
__at(0x0E3E) volatile __CANSTAT_RO8bits_t CANSTAT_RO8bits;

__at(0x0E3F) __sfr CANCON_RO8;
__at(0x0E3F) volatile __CANCON_RO8bits_t CANCON_RO8bits;

__at(0x0E40) __sfr B2CON;
__at(0x0E40) volatile __B2CONbits_t B2CONbits;

__at(0x0E41) __sfr B2SIDH;
__at(0x0E41) volatile __B2SIDHbits_t B2SIDHbits;

__at(0x0E42) __sfr B2SIDL;
__at(0x0E42) volatile __B2SIDLbits_t B2SIDLbits;

__at(0x0E43) __sfr B2EIDH;
__at(0x0E43) volatile __B2EIDHbits_t B2EIDHbits;

__at(0x0E44) __sfr B2EIDL;
__at(0x0E44) volatile __B2EIDLbits_t B2EIDLbits;

__at(0x0E45) __sfr B2DLC;
__at(0x0E45) volatile __B2DLCbits_t B2DLCbits;

__at(0x0E46) __sfr B2D0;
__at(0x0E46) volatile __B2D0bits_t B2D0bits;

__at(0x0E47) __sfr B2D1;
__at(0x0E47) volatile __B2D1bits_t B2D1bits;

__at(0x0E48) __sfr B2D2;
__at(0x0E48) volatile __B2D2bits_t B2D2bits;

__at(0x0E49) __sfr B2D3;
__at(0x0E49) volatile __B2D3bits_t B2D3bits;

__at(0x0E4A) __sfr B2D4;
__at(0x0E4A) volatile __B2D4bits_t B2D4bits;

__at(0x0E4B) __sfr B2D5;
__at(0x0E4B) volatile __B2D5bits_t B2D5bits;

__at(0x0E4C) __sfr B2D6;
__at(0x0E4C) volatile __B2D6bits_t B2D6bits;

__at(0x0E4D) __sfr B2D7;
__at(0x0E4D) volatile __B2D7bits_t B2D7bits;

__at(0x0E4E) __sfr CANSTAT_RO7;
__at(0x0E4E) volatile __CANSTAT_RO7bits_t CANSTAT_RO7bits;

__at(0x0E4F) __sfr CANCON_RO7;
__at(0x0E4F) volatile __CANCON_RO7bits_t CANCON_RO7bits;

__at(0x0E50) __sfr B3CON;
__at(0x0E50) volatile __B3CONbits_t B3CONbits;

__at(0x0E51) __sfr B3SIDH;
__at(0x0E51) volatile __B3SIDHbits_t B3SIDHbits;

__at(0x0E52) __sfr B3SIDL;
__at(0x0E52) volatile __B3SIDLbits_t B3SIDLbits;

__at(0x0E53) __sfr B3EIDH;
__at(0x0E53) volatile __B3EIDHbits_t B3EIDHbits;

__at(0x0E54) __sfr B3EIDL;
__at(0x0E54) volatile __B3EIDLbits_t B3EIDLbits;

__at(0x0E55) __sfr B3DLC;
__at(0x0E55) volatile __B3DLCbits_t B3DLCbits;

__at(0x0E56) __sfr B3D0;
__at(0x0E56) volatile __B3D0bits_t B3D0bits;

__at(0x0E57) __sfr B3D1;
__at(0x0E57) volatile __B3D1bits_t B3D1bits;

__at(0x0E58) __sfr B3D2;
__at(0x0E58) volatile __B3D2bits_t B3D2bits;

__at(0x0E59) __sfr B3D3;
__at(0x0E59) volatile __B3D3bits_t B3D3bits;

__at(0x0E5A) __sfr B3D4;
__at(0x0E5A) volatile __B3D4bits_t B3D4bits;

__at(0x0E5B) __sfr B3D5;
__at(0x0E5B) volatile __B3D5bits_t B3D5bits;

__at(0x0E5C) __sfr B3D6;
__at(0x0E5C) volatile __B3D6bits_t B3D6bits;

__at(0x0E5D) __sfr B3D7;
__at(0x0E5D) volatile __B3D7bits_t B3D7bits;

__at(0x0E5E) __sfr CANSTAT_RO6;
__at(0x0E5E) volatile __CANSTAT_RO6bits_t CANSTAT_RO6bits;

__at(0x0E5F) __sfr CANCON_RO6;
__at(0x0E5F) volatile __CANCON_RO6bits_t CANCON_RO6bits;

__at(0x0E60) __sfr B4CON;
__at(0x0E60) volatile __B4CONbits_t B4CONbits;

__at(0x0E61) __sfr B4SIDH;
__at(0x0E61) volatile __B4SIDHbits_t B4SIDHbits;

__at(0x0E62) __sfr B4SIDL;
__at(0x0E62) volatile __B4SIDLbits_t B4SIDLbits;

__at(0x0E63) __sfr B4EIDH;
__at(0x0E63) volatile __B4EIDHbits_t B4EIDHbits;

__at(0x0E64) __sfr B4EIDL;
__at(0x0E64) volatile __B4EIDLbits_t B4EIDLbits;

__at(0x0E65) __sfr B4DLC;
__at(0x0E65) volatile __B4DLCbits_t B4DLCbits;

__at(0x0E66) __sfr B4D0;
__at(0x0E66) volatile __B4D0bits_t B4D0bits;

__at(0x0E67) __sfr B4D1;
__at(0x0E67) volatile __B4D1bits_t B4D1bits;

__at(0x0E68) __sfr B4D2;
__at(0x0E68) volatile __B4D2bits_t B4D2bits;

__at(0x0E69) __sfr B4D3;
__at(0x0E69) volatile __B4D3bits_t B4D3bits;

__at(0x0E6A) __sfr B4D4;
__at(0x0E6A) volatile __B4D4bits_t B4D4bits;

__at(0x0E6B) __sfr B4D5;
__at(0x0E6B) volatile __B4D5bits_t B4D5bits;

__at(0x0E6C) __sfr B4D6;
__at(0x0E6C) volatile __B4D6bits_t B4D6bits;

__at(0x0E6D) __sfr B4D7;
__at(0x0E6D) volatile __B4D7bits_t B4D7bits;

__at(0x0E6E) __sfr CANSTAT_RO5;
__at(0x0E6E) volatile __CANSTAT_RO5bits_t CANSTAT_RO5bits;

__at(0x0E6F) __sfr CANCON_RO5;
__at(0x0E6F) volatile __CANCON_RO5bits_t CANCON_RO5bits;

__at(0x0E70) __sfr B5CON;
__at(0x0E70) volatile __B5CONbits_t B5CONbits;

__at(0x0E71) __sfr B5SIDH;
__at(0x0E71) volatile __B5SIDHbits_t B5SIDHbits;

__at(0x0E72) __sfr B5SIDL;
__at(0x0E72) volatile __B5SIDLbits_t B5SIDLbits;

